Revit 2024 API
BuiltInFailures.ImportFailures.ImportScaleTooLarge Property
 This scale factor would make the imported object too large. Reverting to the previous scale factor.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId ImportScaleTooLarge { get; }
Visual Basic
Public Shared ReadOnly Property ImportScaleTooLarge As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ ImportScaleTooLarge {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.ImportFailures Class
Autodesk.Revit.DB Namespace